# **1. 강원도에 위치한 생산공장 목록 출력하기(250106)**

In [ ]:
# 문제 설명
# 다음은 식품공장의 정보를 담은 FOOD_FACTORY 테이블입니다. FOOD_FACTORY 테이블은 다음과 같으며
# FACTORY_ID, FACTORY_NAME, ADDRESS, TLNO는 각각 공장 ID, 공장 이름, 주소, 전화번호를 의미합니다.

# Column name	Type	Nullable
# FACTORY_ID	VARCHAR(10)	FALSE
# FACTORY_NAME	VARCHAR(50)	FALSE
# ADDRESS	VARCHAR(100)	FALSE
# TLNO	VARCHAR(20)	TRUE

# 문제
# FOOD_FACTORY 테이블에서 강원도에 위치한 식품공장의 공장 ID, 공장 이름, 주소를 조회하는 SQL문을 작성해주세요. 이때 결과는 공장 ID를 기준으로 오름차순 정렬해주세요.

# 예시
# FOOD_FACTORY 테이블이 다음과 같을 때

# FACTORY_ID	FACTORY_NAME	ADDRESS	TLNO
# | FT19980003 | (주)맛있는라면 | 강원도 정선군 남면 칠현로 679 | 033-431-3122 |
# | FT19980004 | (주)맛있는기름 | 경기도 평택시 포승읍 포승공단순환로 245 | 031-651-2410 |
# | FT20010001 | (주)맛있는소스 | 경상북도 구미시 1공단로7길 58-11 | 054-231-2121 |
# | FT20010002 | (주)맛있는통조림 | 전라남도 영암군 미암면 곤미현로 1336 | 061-341-5210 |
# | FT20100001 | (주)맛있는차 | 전라남도 장성군 서삼면 장산리 233-1번지 | 061-661-1420 |
# | FT20100002 | (주)맛있는김치 | 충청남도 아산시 탕정면 탕정면로 485 | 041-241-5421 |
# | FT20100003 | (주)맛있는음료 | 강원도 원주시 문막읍 문막공단길 154 | 033-232-7630 |
# | FT20100004 | (주)맛있는국 | 강원도 평창군 봉평면 진조길 227-35 | 033-323-6640 |
# | FT20110001 | (주)맛있는밥 | 경기도 화성시 팔탄면 가재리 34번지 | 031-661-1532 |
# | FT20110002 | (주)맛있는과자 | 광주광역시 북구 하서로 222 | 062-211-7759 |

# SQL을 실행하면 다음과 같이 출력되어야 합니다.

# FACTORY_ID	FACTORY_NAME	ADDRESS
# FT19980003	(주)맛있는라면	강원도 정선군 남면 칠현로 679
# FT20100003	(주)맛있는음료	강원도 원주시 문막읍 문막공단길 154
# FT20100004	(주)맛있는국	강원도 평창군 봉평면 진조길 227-35

1) 내가 쓴 답

In [ ]:
# SELECT FACTORY_ID, FACTORY_NAME, ADDRESS
# FROM FOOD_FACTORY
# WHERE ADDRESS LIKE '강원도%'
# ORDER BY FACTORY_ID ASC

# **2. 동물의 아이디와 이름(250108)**

1) 문제

In [ ]:
# 문제 설명
# ANIMAL_INS 테이블은 동물 보호소에 들어온 동물의 정보를 담은 테이블입니다.
# ANIMAL_INS 테이블 구조는 다음과 같으며, ANIMAL_ID, ANIMAL_TYPE, DATETIME, INTAKE_CONDITION, NAME, SEX_UPON_INTAKE는
# 각각 동물의 아이디, 생물 종, 보호 시작일, 보호 시작 시 상태, 이름, 성별 및 중성화 여부를 나타냅니다.

# NAME	TYPE	NULLABLE
# ANIMAL_ID	VARCHAR(N)	FALSE
# ANIMAL_TYPE	VARCHAR(N)	FALSE
# DATETIME	DATETIME	FALSE
# INTAKE_CONDITION	VARCHAR(N)	FALSE
# NAME	VARCHAR(N)	TRUE
# SEX_UPON_INTAKE	VARCHAR(N)	FALSE
# 동물 보호소에 들어온 모든 동물의 아이디와 이름을 ANIMAL_ID순으로 조회하는 SQL문을 작성해주세요.
# SQL을 실행하면 다음과 같이 출력되어야 합니다.

# ANIMAL_ID	NAME
# A349996	Sugar
# A350276	Jewel
# A350375	Meo
# A352555	Harley
# A352713	Gia
# A352872	Peanutbutter
# A353259	Bj
# ((이하 생략))

2) 내가 쓴 답

In [ ]:
# SELECT ANIMAL_ID, NAME
# FROM ANIMAL_INS
# ORDER BY ANIMAL_ID

# **3. 역순 정렬하기(SELECT)(250108)**

In [ ]:
# 문제 설명
# ANIMAL_INS 테이블은 동물 보호소에 들어온 동물의 정보를 담은 테이블입니다.
# ANIMAL_INS 테이블 구조는 다음과 같으며, ANIMAL_ID, ANIMAL_TYPE, DATETIME, INTAKE_CONDITION, NAME, SEX_UPON_INTAKE는
# 각각 동물의 아이디, 생물 종, 보호 시작일, 보호 시작 시 상태, 이름, 성별 및 중성화 여부를 나타냅니다.

# NAME	TYPE	NULLABLE
# ANIMAL_ID	VARCHAR(N)	FALSE
# ANIMAL_TYPE	VARCHAR(N)	FALSE
# DATETIME	DATETIME	FALSE
# INTAKE_CONDITION	VARCHAR(N)	FALSE
# NAME	VARCHAR(N)	TRUE
# SEX_UPON_INTAKE	VARCHAR(N)	FALSE
# 동물 보호소에 들어온 모든 동물의 이름과 보호 시작일을 조회하는 SQL문을 작성해주세요.
# 이때 결과는 ANIMAL_ID 역순으로 보여주세요. SQL을 실행하면 다음과 같이 출력되어야 합니다.

# NAME	DATETIME
# Rocky	2016-06-07 09:17:00
# Shelly	2015-01-29 15:01:00
# Benji	2016-04-19 13:28:00
# Jackie	2016-01-03 16:25:00
# *Sam	2016-03-13 11:17:00
# ..이하 생략

1) 내가 쓴 답

In [ ]:
# SELECT NAME, DATETIME
# FROM ANIMAL_INS
# ORDER BY ANIMAL_ID DESC

# **4. 아픈 동물 찾기(SELECT)(250109)**

In [ ]:
# 문제 설명
# ANIMAL_INS 테이블은 동물 보호소에 들어온 동물의 정보를 담은 테이블입니다.
# ANIMAL_INS 테이블 구조는 다음과 같으며, ANIMAL_ID, ANIMAL_TYPE, DATETIME, INTAKE_CONDITION, NAME, SEX_UPON_INTAKE는
# 각각 동물의 아이디, 생물 종, 보호 시작일, 보호 시작 시 상태, 이름, 성별 및 중성화 여부를 나타냅니다.

# NAME	TYPE	NULLABLE
# ANIMAL_ID	VARCHAR(N)	FALSE
# ANIMAL_TYPE	VARCHAR(N)	FALSE
# DATETIME	DATETIME	FALSE
# INTAKE_CONDITION	VARCHAR(N)	FALSE
# NAME	VARCHAR(N)	TRUE
# SEX_UPON_INTAKE	VARCHAR(N)	FALSE

# 동물 보호소에 들어온 동물 중 아픈 동물1의 아이디와 이름을 조회하는 SQL 문을 작성해주세요.
# 이때 결과는 아이디 순으로 조회해주세요.

# 예시
# 예를 들어 ANIMAL_INS 테이블이 다음과 같다면

# ANIMAL_ID	ANIMAL_TYPE	DATETIME	INTAKE_CONDITION	NAME	SEX_UPON_INTAKE
# A365172	Dog	2014-08-26 12:53:00	Normal	Diablo	Neutered Male
# A367012	Dog	2015-09-16 09:06:00	Sick	Miller	Neutered Male
# A365302	Dog	2017-01-08 16:34:00	Aged	Minnie	Spayed Female
# A381217	Dog	2017-07-08 09:41:00	Sick	Cherokee	Neutered Male
# 이 중 아픈 동물은 Miller와 Cherokee입니다. 따라서 SQL문을 실행하면 다음과 같이 나와야 합니다.

# ANIMAL_ID	NAME
# A367012	Miller
# A381217	Cherokee

1) 내가 쓴 답

In [ ]:
# SELECT ANIMAL_ID, NAME
# FROM ANIMAL_INS
# WHERE INTAKE_CONDITION = 'Sick'
# ORDER BY ANIMAL_ID

# **5. 나이 정보가 없는 회원 수 구하기(250112)**

In [ ]:
# 문제 설명
# 다음은 어느 의류 쇼핑몰에 가입한 회원 정보를 담은 USER_INFO 테이블입니다.
# USER_INFO 테이블은 아래와 같은 구조로 되어있으며,
# USER_ID, GENDER, AGE, JOINED는 각각 회원 ID, 성별, 나이, 가입일을 나타냅니다.

# Column name	Type	Nullable
# USER_ID	INTEGER	FALSE
# GENDER	TINYINT(1)	TRUE
# AGE	INTEGER	TRUE
# JOINED	DATE	FALSE
# GENDER 컬럼은 비어있거나 0 또는 1의 값을 가지며 0인 경우 남자를, 1인 경우는 여자를 나타냅니다.

# 문제
# USER_INFO 테이블에서 나이 정보가 없는 회원이 몇 명인지 출력하는 SQL문을 작성해주세요. 이때 컬럼명은 USERS로 지정해주세요.

# 예시
# 예를 들어 USER_INFO 테이블이 다음과 같다면

# USER_ID	GENDER	AGE	JOINED
# 1	1	26	2021-06-01
# 2	NULL	NULL	2021-07-25
# 3	1	NULL	2021-07-30
# 4	0	31	2021-08-03
# 나이 정보가 없는 회원은 2명 이므로, 다음과 같은 결과가 나와야 합니다.

# USERS
# 2

1) 내가 쓴 답

In [ ]:
# SELECT COUNT(*) AS USERS
# FROM USER_INFO
# WHERE AGE IS NULL

# **6. 상위 n개 레코드(250113)(SELECT)**

In [ ]:
# 문제 설명
# ANIMAL_INS 테이블은 동물 보호소에 들어온 동물의 정보를 담은 테이블입니다.
# ANIMAL_INS 테이블 구조는 다음과 같으며, ANIMAL_ID, ANIMAL_TYPE, DATETIME, INTAKE_CONDITION, NAME, SEX_UPON_INTAKE는
# 각각 동물의 아이디, 생물 종, 보호 시작일, 보호 시작 시 상태, 이름, 성별 및 중성화 여부를 나타냅니다.

# NAME	TYPE	NULLABLE
# ANIMAL_ID	VARCHAR(N)	FALSE
# ANIMAL_TYPE	VARCHAR(N)	FALSE
# DATETIME	DATETIME	FALSE
# INTAKE_CONDITION	VARCHAR(N)	FALSE
# NAME	VARCHAR(N)	TRUE
# SEX_UPON_INTAKE	VARCHAR(N)	FALSE

# 동물 보호소에 가장 먼저 들어온 동물의 이름을 조회하는 SQL 문을 작성해주세요.

# 예시
# 예를 들어 ANIMAL_INS 테이블이 다음과 같다면

# ANIMAL_ID	ANIMAL_TYPE	DATETIME	INTAKE_CONDITION	NAME	SEX_UPON_INTAKE
# A399552	Dog	2013-10-14 15:38:00	Normal	Jack	Neutered Male
# A379998	Dog	2013-10-23 11:42:00	Normal	Disciple	Intact Male
# A370852	Dog	2013-11-03 15:04:00	Normal	Katie	Spayed Female
# A403564	Dog	2013-11-18 17:03:00	Normal	Anna	Spayed Female
# 이 중 가장 보호소에 먼저 들어온 동물은 Jack입니다. 따라서 SQL문을 실행하면 다음과 같이 나와야 합니다.

# NAME
# Jack
# ※ 보호소에 가장 먼저 들어온 동물은 한 마리인 경우만 테스트 케이스로 주어집니다.

1) 내가 쓴 답

In [ ]:
# SELECT NAME
# FROM ANIMAL_INS
# ORDER BY DATETIME LIMIT 1

# **7. 동물 수 구하기(250114)(SUM, MAX, MIN)**

In [ ]:
# 문제 설명
# ANIMAL_INS 테이블은 동물 보호소에 들어온 동물의 정보를 담은 테이블입니다.
# ANIMAL_INS 테이블 구조는 다음과 같으며, ANIMAL_ID, ANIMAL_TYPE, DATETIME, INTAKE_CONDITION, NAME, SEX_UPON_INTAKE는
# 각각 동물의 아이디, 생물 종, 보호 시작일, 보호 시작 시 상태, 이름, 성별 및 중성화 여부를 나타냅니다.

# NAME	TYPE	NULLABLE
# ANIMAL_ID	VARCHAR(N)	FALSE
# ANIMAL_TYPE	VARCHAR(N)	FALSE
# DATETIME	DATETIME	FALSE
# INTAKE_CONDITION	VARCHAR(N)	FALSE
# NAME	VARCHAR(N)	TRUE
# SEX_UPON_INTAKE	VARCHAR(N)	FALSE
# 동물 보호소에 동물이 몇 마리 들어왔는지 조회하는 SQL 문을 작성해주세요.

# 예시
# 예를 들어 ANIMAL_INS 테이블이 다음과 같다면

# ANIMAL_ID	ANIMAL_TYPE	DATETIME	INTAKE_CONDITION	NAME	SEX_UPON_INTAKE
# A399552	Dog	2013-10-14 15:38:00	Normal	Jack	Neutered Male
# A379998	Dog	2013-10-23 11:42:00	Normal	Disciple	Intact Male
# A370852	Dog	2013-11-03 15:04:00	Normal	Katie	Spayed Female
# A403564	Dog	2013-11-18 17:03:00	Normal	Anna	Spayed Female
# 동물 보호소에 들어온 동물은 4마리입니다. 따라서 SQL문을 실행하면 다음과 같이 나와야 합니다.

# count
# 4
# ※ 컬럼 이름(위 예제에서는 count)은 일치하지 않아도 됩니다.

1) 내가 쓴 답

In [ ]:
# SELECT COUNT(*)
# FROM ANIMAL_INS

# **8. 이름이 있는 동물의 아이디(250118)**

In [ ]:
# 문제 설명
# ANIMAL_INS 테이블은 동물 보호소에 들어온 동물의 정보를 담은 테이블입니다.
# ANIMAL_INS 테이블 구조는 다음과 같으며, ANIMAL_ID, ANIMAL_TYPE, DATETIME, INTAKE_CONDITION, NAME, SEX_UPON_INTAKE는
# 각각 동물의 아이디, 생물 종, 보호 시작일, 보호 시작 시 상태, 이름, 성별 및 중성화 여부를 나타냅니다.

# NAME	TYPE	NULLABLE
# ANIMAL_ID	VARCHAR(N)	FALSE
# ANIMAL_TYPE	VARCHAR(N)	FALSE
# DATETIME	DATETIME	FALSE
# INTAKE_CONDITION	VARCHAR(N)	FALSE
# NAME	VARCHAR(N)	TRUE
# SEX_UPON_INTAKE	VARCHAR(N)	FALSE

# 동물 보호소에 들어온 동물 중, 이름이 있는 동물의 ID를 조회하는 SQL 문을 작성해주세요.
# 단, ID는 오름차순 정렬되어야 합니다.

# 예시
# 예를 들어 ANIMAL_INS 테이블이 다음과 같다면

# ANIMAL_ID	ANIMAL_TYPE	DATETIME	INTAKE_CONDITION	NAME	SEX_UPON_INTAKE
# A434523	Cat	2015-11-20 14:18:00	Normal	NULL	Spayed Female
# A562649	Dog	2014-03-20 18:06:00	Sick	NULL	Spayed Female
# A524634	Dog	2015-01-02 18:54:00	Normal	*Belle	Intact Female
# A465637	Dog	2017-06-04 08:17:00	Injured	*Commander	Neutered Male
# 이름이 있는 동물의 ID는 A524634와 A465637입니다. 따라서 SQL을 실행하면 다음과 같이 출력되어야 합니다.

# ANIMAL_ID
# A465637
# A524634

1) 내가 쓴 답

In [ ]:
# SELECT ANIMAL_ID
# FROM ANIMAL_INS
# WHERE NAME IS NOT NULL
# ORDER BY ANIMAL_ID

# **9. 가장 비싼 상품 구하기(250118)(SUM, MAX, MIN)**

In [1]:
# 문제 설명
# 다음은 어느 의류 쇼핑몰에서 판매 중인 상품들의 정보를 담은 PRODUCT 테이블입니다.
# PRODUCT 테이블은 아래와 같은 구조로 되어있으며, PRODUCT_ID, PRODUCT_CODE, PRICE는 각각 상품 ID, 상품코드, 판매가를 나타냅니다.

# Column name	Type	Nullable
# PRODUCT_ID	INTEGER	FALSE
# PRODUCT_CODE	VARCHAR(8)	FALSE
# PRICE	INTEGER	FALSE
# 상품 별로 중복되지 않는 8자리 상품코드 값을 가지며, 앞 2자리는 카테고리 코드를 의미합니다.

# 문제
# PRODUCT 테이블에서 판매 중인 상품 중 가장 높은 판매가를 출력하는 SQL문을 작성해주세요.
# 이때 컬럼명은 MAX_PRICE로 지정해주세요.

# 예시
# 예를 들어 PRODUCT 테이블이 다음과 같다면

# PRODUCT_ID	PRODUCT_CODE	PRICE
# 1	A1000001	10000
# 2	A2000005	9000
# 3	C1000006	22000
# 가장 높은 판매가는 22,000 원 이므로, 다음과 같은 결과가 나와야 합니다.

# MAX_PRICE
# 22000

1) 내가 쓴 답

In [2]:
# SELECT MAX(PRICE) as MAX_PRICE
# FROM PRODUCT